/*
Напишите AJAX-запрос на адрес "http://danit.com.ua/login" для
  Авторизации пользователя. Если пользователь ввел правильный логин и
  пароль - нужно вывести под формой сообщение "Вы авторизированы!".
  Если неправильный - вывести сообщение "Логин или пароль неверные,
  попробуйте еще раз".
  Тестовые правильные данные:
      login: Mandor
      password: Savall
  
  данные нужно передавать в формате JSON
  
    В случае успешного ответа вы получите объект с полем status, равным "Success".
  В случае неуспешного ответа - с полем status, равным "Error".
  */