/*
Возьмите все js файлы в этой папке, кроме "app.js", и сложите их в папку
"components", логично организовав их там, и экспортировав из нее 
нужные классы так, чтобы они были доступны извне для импорта.

Также добавьте в папку "components" файл loginForm, в котором напишите 
форму авторизации, соответствующиую таким правилам:
- метод render будет возращать форму с 2 полями ввода: Логин/email и Пароль. Для отрисовки полей используйте класс Input из предыдущего задания.
- метод handleSumbit будет проверять заполнены ли оба поля ввода.
*/
